<script>
    import SectionTitle from '$lib/component/SectionTitle.svelte'
    import Price from '../../lib/component/Price.svelte';
</script>


<svelte:head>
    <title>Цены в Z-park</title>
</svelte:head>

<SectionTitle value='Цены в Z-park'/>

<div class='content'>
    <Price
    title='Посещение парка до 18 лет'
    line={[
        ['Понедельник-четверг (1 чac - весь день)', '11 byn - 16 byn',],
        ['Пятница (1 чac - весь день)', ' 13 byn - 19 byn',],
        ['Субота-воскресение, каникулы, праздничные дни (1 чac - весь день)', '16 byn - 19 byn'],
    ]}
    />
    <Price
    title='бронирование комнат'
    line={[
        ['на 2 часа', 'Бесплатно', 'При заказе на баре от 60 byn (всё, кроме пиццы)'],
    ]}
    />
    <Price
    title='продлени комнаты'
    line={[
        ['Будний день', '40 byn'],
        ['Выходные, Праздники, каникулы', '50 byn'],
    ]}
    />
    <Price
    title='Бронирование столов'
    line={[
        ['стол до 10 человек', ' Беспланто', 'При заказе на баре от 50 BYN (всё, кроме пиццы)'],
        ['стол до 14 человек', ' Беспланто', 'При заказе на баре от 60 BYN (всё, кроме пиццы)'],
        ['будни', '-', 'Столики бронироуются в любое время'],
        ['Суббота', '-', '(10:00 - 15:00) (15:30 - 20:30)'],
        ['Воскресение', '-', '(10:00 - 14:30) (15:00 - 19:30)'],
    ]}
    />
    <Price
    title='Анимации'
    line={[
        ['Вынос торта(1 герой)', ' 20 BYN'],
        ['Флешмоб', ' 35 BYN', 'Это особенный танец, который провобится с героем, во время этого танца дети могут веселиться и развлекаться всмете с героем, а в конце имениннику вынесут торт и он задует свечки'],
        ['Флешмоб + вынос торта(1 герой)', '35 BYN'],
        ['Программа', '65 BYN', 'Программа это то, чем можно поздравить именнинника и оставить массу положительных эмоций об этом дне'],
        ['Блестящая дискотека', '80 BYN'],
        ['Дополнительный герой', '20 BYN'],
    ]}
    />
</div>


<style>
    .content {
        background: #eaeaea;
    }
    @media screen and (min-width: 600px) {
        .content {
            padding: 50px;
        }
    }
    @media screen and (max-width: 600px) {
        .content {
            padding: 20px 10px;
        }
    }
</style>
